{
  "title": "An Algorithm and Analysis of Social Topologies from Email and Photo Tags",
  "year": 2011,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2011-SocialTopologies-SNAKDD.pdf",
  "abstract": "As peoples' participation in social media increases, online social identities accumulate contacts and data. We need a mechanism for creating a succinct but contextually rich representation of a person’s \"social landscape\" that would facilitate activities such as browsing personal social media feeds, or sharing data with nuanced social groups.\r\n\r\nWe formulate the social topology extraction problem as the compression of a group-tagged data set in which each group has a significance value, into a set containing a smaller number of overlapping and nested groups that best represent the value of the initial data set. We present four variants of a greedy algorithm that constructs a user's social topology based on egocentric, group communication data. We analyze our algorithm variants on about 2,000 personal email accounts and 1,100 tagged Facebook photograph collections. We find that our algorithm variants produce different topologies suitable for different purposes.\r\n\r\nWe show that our algorithm can capture 80% of the input data set value with 20% and 42% of the number of input groups for email and photographs respectively. Using edit distance as an objective metric, we also show that our algorithm outperforms results generated by Newman’s modularity-based clustering algorithm. We conclude that our algorithm is appropriately designed to find significant groups of friends from social contact data.",
  "thumbnail": "images/thumbs/analysis-social-topologies.gif",
  "figure": "",
  "caption": "",
  "web_name": "analysis-social-topologies",
  "visible": true,
  "mod_date": "2011-08-05",
  "note": "",
  "pub_date": "2011-07-01",
  "venue": "SNAKDD",
  "authors": [
    {
      "first_name": "T. J.",
      "last_name": "Purtell"
    },
    {
      "first_name": "Diana",
      "last_name": "MacLean",
      "url": "http://www.stanford.edu/~malcdi/"
    },
    {
      "first_name": "Seng Keat",
      "last_name": "Teh"
    },
    {
      "first_name": "Sudheendra",
      "last_name": "Hangal"
    },
    {
      "first_name": "Monica",
      "last_name": "Lam",
      "display_name": "Monica S. Lam"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [
    {
      "name": "Application",
      "link": "http://mobisocial.stanford.edu/groupgenie/"
    },
    {
      "name": "Software",
      "link": "http://github.com/mobisocial/groupgenie-algo/"
    }
  ],
  "tags": [],
  "doi": null
}
