{
  "title": "Boba: Authoring and Visualizing Multiverse Analyses",
  "year": 2021,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2021-BobaMultiverse-VAST.pdf",
  "abstract": "Multiverse analysis is an approach to data analysis in which all \"reasonable\" analytic decisions are evaluated in parallel and interpreted collectively, in order to foster robustness and transparency. However, specifying a multiverse is demanding because analysts must manage myriad variants from a cross-product of analytic decisions, and the results require nuanced interpretation. We contribute Boba: an integrated domain-specific language (DSL) and visual analysis system for authoring and reviewing multiverse analyses. With the Boba DSL, analysts write the shared portion of analysis code only once, alongside local variations defining alternative decisions, from which the compiler generates a multiplex of scripts representing all possible analysis paths. The Boba Visualizer provides linked views of model results and the multiverse decision space to enable rapid, systematic assessment of consequential decisions and robustness, including sampling uncertainty and model fit. We demonstrate Boba's utility through two data analysis case studies, and reflect on challenges and design opportunities for multiverse analysis software.",
  "thumbnail": "images/thumbs/boba.png",
  "figure": "images/figures/boba.png",
  "caption": "Authoring and visualizing multiverse analyses with Boba. Users start by annotating a script with analytic decisions (a), from which Boba synthesizes a multiplex of possible analysis variants (b). To interpret the results from all analyses, users start with a graph of analytic decisions (c), where sensitive decisions are highlighted in darker blues. Clicking a decision node allows users to compare point estimates (d, blue dots) and uncertainty distributions (d, gray area) between different alternatives. Users may further drill down to assess the fit quality of individual models (e) by comparing observed data (pink) with model predictions (teal).",
  "web_name": "boba",
  "visible": true,
  "mod_date": "2021-01-03",
  "note": null,
  "pub_date": "2021-01-03",
  "venue": "VAST-TVCG",
  "authors": [
    {
      "first_name": "Yang",
      "last_name": "Liu",
      "url": "http://yangliu.life/"
    },
    {
      "first_name": "Alex",
      "last_name": "Kale",
      "url": "https://people.cs.uchicago.edu/~kalea/"
    },
    {
      "first_name": "Tim",
      "last_name": "Althoff",
      "url": "http://timalthoff.de/"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [
    {
      "name": "Supplement",
      "link": "https://osf.io/9dcfa/"
    },
    {
      "name": "Software",
      "link": "https://github.com/uwdata/boba"
    }
  ],
  "tags": [],
  "doi": "https://doi.org/10.1109/TVCG.2020.3028985"
}