{
  "title": "Visual Reasoning Strategies for Effect Size Judgments and Decisions",
  "year": 2021,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2021-EffectSizeJudgments-VIS.pdf",
  "abstract": "Uncertainty visualizations often emphasize point estimates to support magnitude estimates or decisions through visual comparison. However, when design choices emphasize means, users may overlook uncertainty information and misinterpret visual distance as a proxy for effect size. We present findings from a mixed design experiment on Mechanical Turk which tests eight uncertainty visualization designs: 95% containment intervals, hypothetical outcome plots, densities, and quantile dotplots, each with and without means added. We find that adding means to uncertainty visualizations has small biasing effects on both magnitude estimation and decision-making, consistent with discounting uncertainty. We also see that visualization designs that support the least biased effect size estimation do not support the best decision-making, suggesting that a chart user's sense of effect size may not necessarily be identical when they use the same information for different tasks. In a qualitative analysis of users’ strategy descriptions, we find that many users switch strategies and do not employ an optimal strategy when one exists. Uncertainty visualizations which are optimally designed in theory may not be the most effective in practice because of the ways that users satisfice with heuristics, suggesting opportunities to better understand visualization effectiveness by modeling sets of potential strategies.",
  "thumbnail": "images/thumbs/effect-size-judgments.png",
  "figure": "images/figures/effect-size-judgments.png",
  "caption": "Visualization designs evaluated in the experiment.",
  "web_name": "effect-size-judgments",
  "visible": true,
  "mod_date": "2021-01-01",
  "note": "Best Paper Award",
  "pub_date": "2021-01-01",
  "venue": "VIS",
  "authors": [
    {
      "first_name": "Alex",
      "last_name": "Kale",
      "url": "https://people.cs.uchicago.edu/~kalea/"
    },
    {
      "first_name": "Matthew",
      "last_name": "Kay"
    },
    {
      "first_name": "Jessica",
      "last_name": "Hullman",
      "url": "http://faculty.washington.edu/jhullman"
    }
  ],
  "materials": [
    {
      "name": "Supplement",
      "link": "https://github.com/kalealex/effect-size-jdm"
    }
  ],
  "tags": [],
  "doi": "https://doi.org/10.1109/TVCG.2020.3030335"
}