{
  "title": "Engraft: An API for Live, Rich, and Composable Programming",
  "year": 2023,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2023-Engraft-UIST.pdf",
  "abstract": "Live & rich tools can support a diversity of domain-specific pro- gramming tasks, from visualization authoring to data wrangling. Real-world programming, however, requires performing multiple tasks in concert, calling for the use of multiple tools alongside conventional code. Programmers lack environments capable of composing live & rich tools to support these situations. To enable this composition, we contribute Engraft, a component-based API that allows live & rich tools to be embedded within larger environments like computational notebooks. Through recursive embedding of components, Engraft enables several new forms of composition: not only embedding tools inside environments, but also embedding environments within each other and embedding tools and environments in the outside world, including conventional codebases. We demonstrate Engraft with examples from diverse domains, including web-application development, command-line scripting, and physics education. By providing composability, Engraft can help cultivate a cycle of use and innovation in live & rich programming.",
  "thumbnail": "images/thumbs/engraft.png",
  "figure": "images/figures/engraft.png",
  "caption": "Through a uniform component/host interface, Engraft enables three forms of composition for live and rich tools.",
  "web_name": "engraft",
  "visible": true,
  "mod_date": "2023-10-22",
  "note": null,
  "pub_date": "2023-10-22",
  "venue": "UIST",
  "authors": [
    {
      "first_name": "Josh",
      "last_name": "Horowitz",
      "url": "http://joshuahhh.com/"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [
    {
      "name": "Software",
      "link": "https://github.com/engraftdev/engraft"
    }
  ],
  "tags": [],
  "doi": "10.1145/3586183.3606733"
}
