{
  "title": "Enterprise Data Analysis and Visualization: An Interview Study",
  "year": 2012,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2012-EnterpriseAnalysisInterviews-VAST.pdf",
  "abstract": "Organizations rely on data analysts to model customer engagement, streamline operations, improve production, inform business decisions, and combat fraud. Though numerous analysis and visualization tools have been built to improve the scale and efficiency at which analysts can work, there has been little research on how analysis takes place within the social and organizational context of companies. To better understand the enterprise analysts’ ecosystem, we conducted semi-structured interviews with 35 data analysts from 25 organizations across a variety of sectors, including healthcare, retail, marketing and finance. Based on our interview data, we characterize the process of industrial data analysis and document how organizational features of an enterprise impact it. We describe recurring pain points, outstanding challenges, and barriers to adoption for visual analytic tools. Finally, we discuss design implications and opportunities for visual analysis research.",
  "thumbnail": "images/thumbs/enterprise-analysis-interviews_1.gif",
  "figure": "",
  "caption": "",
  "web_name": "enterprise-analysis-interviews",
  "visible": true,
  "mod_date": "2012-10-01",
  "note": "Honorable Mention Award · Test-of-Time Award",
  "pub_date": "2012-09-09",
  "venue": "VAST",
  "authors": [
    {
      "first_name": "Sean",
      "last_name": "Kandel",
      "url": "http://skandel.us"
    },
    {
      "first_name": "Andreas",
      "last_name": "Paepcke"
    },
    {
      "first_name": "Joseph",
      "last_name": "Hellerstein",
      "url": "http://db.cs.berkeley.edu/jmh/"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [],
  "tags": [],
  "doi": "10.1109/TVCG.2012.219"
}