{
  "title": "Fidyll: A Compiler for Cross-Format Data Stories & Explorable Explanations",
  "year": 2022,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2022-Fidyll-arXiv.pdf",
  "abstract": "Narrative visualization is a powerful communicative tool that can take on various formats such as interactive articles, slideshows, and data videos. These formats each have their strengths and weaknesses, but existing authoring tools only support one output target. We conducted a series of formative interviews with seven domain experts to understand needs and practices around cross-format data stories, and developed Fidyll, a cross-format compiler for authoring interactive data stories and explorable explanations. Our open-source tool can be used to rapidly create formats including static articles, low-motion articles, interactive articles, slideshows, and videos. We evaluate our system through a series of real-world usage scenarios, showing how it benefits authors in the domains of data journalism, scientific publishing, and nonprofit advocacy. We show how Fidyll provides expressive leverage by reducing the amount of non-narrative markup that authors need to write by 80-90% compared to Idyll, an existing markup language for authoring interactive articles.",
  "thumbnail": "images/thumbs/fidyll.png",
  "figure": "images/figures/fidyll.png",
  "caption": "Fidyll supports serializing five different output formats from a single source document. Here different versions of the case study Quantifying Political Ideology are shown. The different formats each have their own strengths and weaknesses.",
  "web_name": "fidyll",
  "visible": true,
  "mod_date": "2022-05-19",
  "note": null,
  "pub_date": "2022-05-19",
  "venue": "arXiv",
  "authors": [
    {
      "first_name": "Matt",
      "last_name": "Conlen",
      "url": "https://mathisonian.com/"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [],
  "tags": [
    "communication"
  ],
  "doi": "10.48550/arXiv.2205.09858"
}