{
  "title": "Hypothetical Outcome Plots Help Untrained Observers Judge Trends in Ambiguous Data",
  "year": 2019,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2019-HOPsTrends-InfoVis.pdf",
  "abstract": "Animated representations of outcomes drawn from distributions (hypothetical outcome plots, or HOPs) are used in the media and other public venues to communicate uncertainty. HOPs greatly improve multivariate probability estimation over conventional static uncertainty visualizations and leverage the ability of the visual system to quickly, accurately, and automatically process the summary statistical properties of ensembles. However, it is unclear how well HOPs support applied tasks resembling real world judgments posed in uncertainty communication. We identify and motivate an appropriate task to investigate realistic judgments of uncertainty in the public domain through a qualitative analysis of uncertainty visualizations in the news. We contribute two crowdsourced experiments comparing the effectiveness of HOPs, error bars, and line ensembles for supporting perceptual decision-making from visualized uncertainty. Participants infer which of two possible underlying trends is more likely to have produced a sample of time series data by referencing uncertainty visualizations which depict the two trends with variability due to sampling error. By modeling each participant’s accuracy as a function of the level of evidence presented over many repeated judgments, we find that observers are able to correctly infer the underlying trend in samples conveying a lower level of evidence when using HOPs rather than static aggregate uncertainty visualizations as a decision aid. Modeling approaches like ours contribute theoretically grounded and richly descriptive accounts of user perceptions to visualization evaluation.",
  "thumbnail": "images/thumbs/hops-trends.png",
  "figure": "images/figures/hops-trends.png",
  "caption": "We present two experiments (E1 and E2) evaluating four different uncertainty visualizations (from left to right): bar graphs with error bars, bar hypothetical outcome plots (HOPs), static line ensembles, and line HOPs.",
  "web_name": "hops-trends",
  "visible": true,
  "mod_date": "2019-01-01",
  "note": null,
  "pub_date": "2019-01-02",
  "venue": "InfoVis",
  "authors": [
    {
      "first_name": "Alex",
      "last_name": "Kale",
      "url": "https://people.cs.uchicago.edu/~kalea/"
    },
    {
      "first_name": "Francis",
      "last_name": "Nguyen"
    },
    {
      "first_name": "Matthew",
      "last_name": "Kay"
    },
    {
      "first_name": "Jessica",
      "last_name": "Hullman",
      "url": "http://faculty.washington.edu/jhullman"
    }
  ],
  "materials": [
    {
      "name": "Data",
      "link": "https://github.com/kalealex/jobs-report-hops"
    }
  ],
  "tags": [],
  "doi": "10.1109/TVCG.2018.2864909"
}
