{
  "title": "Sizing the Horizon: The Effects of Chart Size and Layering on the Graphical Perception of Time Series Visualizations",
  "year": 2009,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2009-TimeSeries-CHI.pdf",
  "abstract": "We investigate techniques for visualizing time series data and evaluate their effect in value comparison tasks. We compare line charts with horizon graphs--a space-efficient time series visualization technique--across a range of chart sizes, measuring the speed and accuracy of subjects’ estimates of value differences between charts. We identify transition points at which reducing the chart height results in significantly differing drops in estimation accuracy across the compared chart types, and we find optimal positions in the speed-accuracy tradeoff curve at which viewers performed quickly without attendant drops in accuracy. Based on these results, we propose approaches for increasing data density that optimize graphical perception.",
  "thumbnail": "images/thumbs/horizon.gif",
  "figure": "images/figures/horizon_construction.png",
  "caption": "Horizon graph construction. A normal line chart is divided into bands defined by uniform value ranges. The bands are layered to reduce the chart height. Negative values can be mirrored or offset into the same space as positive values.",
  "web_name": "horizon",
  "visible": true,
  "mod_date": "2009-08-04",
  "note": "Best Paper Award",
  "pub_date": "2009-04-01",
  "venue": "CHI",
  "authors": [
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    },
    {
      "first_name": "Nicholas",
      "last_name": "Kong",
      "url": "http://www.eecs.berkeley.edu/~nkong/"
    },
    {
      "first_name": "Maneesh",
      "last_name": "Agrawala",
      "url": "http://graphics.stanford.edu/~maneesh/"
    }
  ],
  "materials": [],
  "tags": [],
  "doi": "https://doi.org/10.1145/1518701.1518897"
}