{
  "title": "Lyra: An Interactive Visualization Design Environment",
  "year": 2014,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2014-Lyra-EuroVis.pdf",
  "abstract": "We present Lyra, an interactive environment for designing customized visualizations without writing code. Using drag-and-drop interactions, designers can bind data to the properties of graphical marks to author expressive visualization designs. Marks can be moved, rotated and resized using handles; relatively positioned using connectors; and parameterized by data fields using property drop zones. Lyra also provides a data pipeline interface for iterative, visual specification of data transformations and layout algorithms. Visualizations created with Lyra are represented as specifications in Vega, a declarative visualization grammar that enables sharing and reuse. We evaluate Lyra’s expressivity and accessibility through diverse examples and studies with journalists and visualization designers. We find that Lyra enables users to rapidly develop customized visualizations, covering a design space comparable to existing programming-based tools.",
  "thumbnail": "images/thumbs/lyra.png",
  "figure": "images/figures/lyra.png",
  "caption": "William Playfair’s classic chart comparing the price of wheat and wages in England recreated in the Lyra visualization design environment (VDE).",
  "web_name": "lyra",
  "visible": true,
  "mod_date": "2014-04-22",
  "note": null,
  "pub_date": "2014-06-05",
  "venue": "EuroVis",
  "authors": [
    {
      "first_name": "Arvind",
      "last_name": "Satyanarayan",
      "url": "http://arvindsatya.com/"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [
    {
      "name": "Supplement",
      "link": "http://idl.cs.washington.edu/files/2014-Lyra-Supplement.pdf"
    },
    {
      "name": "Application",
      "link": "http://idl.cs.washington.edu/projects/lyra/"
    },
    {
      "name": "Software",
      "link": "https://github.com/uwdata/lyra"
    },
    {
      "name": "Video",
      "link": "http://vimeo.com/96104443"
    }
  ],
  "tags": [],
  "doi": "10.1111/cgf.12391"
}