{
  "title": "Data Through Others' Eyes: The Impact of Visualizing Others' Expectations on Visualization Interpretation",
  "year": 2018,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2018-OthersExpectations-InfoVis.pdf",
  "abstract": "In addition to visualizing input data, interactive visualizations have the potential to be social artifacts that reveal other people's perspectives on the data. However, how such social information embedded in a visualization impacts a viewer's interpretation of the data remains unknown. Inspired by recent interactive visualizations that display people's expectations of data against the data, we conducted a controlled experiment to evaluate the effect of showing social information in the form of other people's expectations on people's ability to recall the data, the degree to which they adjust their expectations to align with the data, and their trust in the accuracy of the data. We found that social information that exhibits a high degree of consensus lead participants to recall the data more accurately relative to participants who were exposed to the data alone. Additionally, participants trusted the accuracy of the data less and were more likely to maintain their initial expectations when other people's expectations aligned with their own initial expectations but not with the data. We conclude by characterizing the design space for visualizing others' expectations alongside data.",
  "thumbnail": "images/thumbs/others-expectations.png",
  "figure": "images/figures/others-expectations.png",
  "caption": "Hypotheses, conditions and example stimuli from our experiment on integrating others' predictions about data into a visualization. If participants are assigned to the Social-Absent condition, they examine only the data. If the participant is assigned to one of the Social conditions, they examine one of four stimuli combining a level of congruency (the alignment between the data trend and the social signal) with a level of the degree of consensus (how much the individual predictions that make up the social signal tend to agree).",
  "web_name": "others-expectations",
  "visible": true,
  "mod_date": "2017-08-12",
  "note": null,
  "pub_date": "2018-01-03",
  "venue": "InfoVis",
  "authors": [
    {
      "first_name": "Yea-Seul",
      "last_name": "Kim",
      "url": "https://pages.cs.wisc.edu/~yeaseulkim/"
    },
    {
      "first_name": "Katharina",
      "last_name": "Reinecke",
      "url": "https://homes.cs.washington.edu/~reinecke/"
    },
    {
      "first_name": "Jessica",
      "last_name": "Hullman",
      "url": "http://faculty.washington.edu/jhullman"
    }
  ],
  "materials": [],
  "tags": [],
  "doi": "10.1109/TVCG.2017.2745240"
}
