{
  "title": "SetCoLa: High-Level Constraints for Graph Layout",
  "year": 2018,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2018-SetCoLa-EuroVis.pdf",
  "abstract": "Constraints enable flexible graph layout by combining the ease of automatic layout with customizations for a particular domain. However, constraint-based layout often requires many individual constraints defined over specific nodes and node pairs. In addition to the effort of writing and maintaining a large number of similar constraints, such constraints are specific to the particular graph and thus cannot generalize to other graphs in the same domain. To facilitate the specification of customized and generalizable constraint layouts, we contribute SetCoLa: a domain-specific language for specifying high-level constraints relative to properties of the backing data. Users identify node sets based on data or graph properties and apply high-level constraints within each set. Applying constraints to node sets rather than individual nodes reduces specification effort and facilitates reapplication of customized layouts across distinct graphs. We demonstrate the conciseness, generalizability, and expressiveness of SetCoLa on a series of real-world examples from ecological networks, biological systems, and social networks.",
  "thumbnail": "images/thumbs/setcola.png",
  "figure": "images/figures/setcola.png",
  "caption": "The layout for the TLR4 biological system produced using (a) Cerebral, a domain-specific layout tool, as compared to (b) SetCoLa. The layers correspond to the location of the biomolecule within a cell and show immune response outcomes at the bottom of the graph, grouped by molecular function.",
  "web_name": "setcola",
  "visible": true,
  "mod_date": "2018-06-04",
  "note": null,
  "pub_date": "2018-06-04",
  "venue": "EuroVis",
  "authors": [
    {
      "first_name": "Jane",
      "last_name": "Hoffswell",
      "url": "https://jhoffswell.github.io/"
    },
    {
      "first_name": "Alan",
      "last_name": "Borning",
      "url": "https://www.cs.washington.edu/people/faculty/borning"
    },
    {
      "first_name": "Jeffrey",
      "last_name": "Heer",
      "url": "http://homes.cs.washington.edu/~jheer/"
    }
  ],
  "materials": [
    {
      "name": "Appendix",
      "link": "http://idl.cs.washington.edu/files/2018-SetCoLa-Appendix.pdf"
    },
    {
      "name": "Software",
      "link": "https://github.com/uwdata/setcola"
    }
  ],
  "tags": [],
  "doi": "10.1111/cgf.13440"
}