{
  "title": "Generating Personalized Spatial Analogies for Distances and Areas",
  "year": 2016,
  "start_page": null,
  "end_page": null,
  "volume": null,
  "issue": null,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2016-SpatialAnalogies-CHI.pdf",
  "abstract": "Distances and areas frequently appear in text articles. However, people struggle to understand these measurements when they cannot relate them to measurements of locations that they are personally familiar with. We contribute tools for generating personalized spatial analogies: re-expressions that contextualize spatial measurements in terms of locations with similar measurements that are more familiar to the user. Our automated approach takes a user’s location and generates a personalized spatial analogy for a target distance or area using landmarks. We present an interactive application that tags distances, areas, and locations in a text article and presents personalized spatial analogies using interactive maps. We find that users who view a personalized spatial analogy map generated by our system rate the helpfulness of the information for understanding a distance or area 1.9 points higher (on a 7 pt scale) than when they see the article with no spatial analogy and 0.7 points higher than when they see generic spatial analogy.",
  "thumbnail": "images/thumbs/spatial-analogies.png",
  "figure": "images/figures/spatial-analogies.png",
  "caption": "An article containing spatial references for a user located in Seattle, WA, alongside examples of automatically generated personalized distance analogy maps (lower left, center) and personalized area analogy maps (top left, right).",
  "web_name": "spatial-analogies",
  "visible": true,
  "mod_date": "2016-04-01",
  "note": null,
  "pub_date": "2016-04-01",
  "venue": "CHI",
  "authors": [
    {
      "first_name": "Yea-Seul",
      "last_name": "Kim",
      "url": "https://pages.cs.wisc.edu/~yeaseulkim/"
    },
    {
      "first_name": "Jessica",
      "last_name": "Hullman",
      "url": "http://faculty.washington.edu/jhullman"
    },
    {
      "first_name": "Maneesh",
      "last_name": "Agrawala",
      "url": "http://graphics.stanford.edu/~maneesh/"
    }
  ],
  "materials": [
    {
      "name": "Supplement",
      "link": "https://bitbucket.org/yeaseulK/chi16-geospatial-analogy"
    }
  ],
  "tags": [],
  "doi": "10.1145/2858036.2858440"
}