{
  "title": "Vispedia: Interactive Visual Exploration of Wikipedia Data via  Search-Based Integration",
  "year": 2008,
  "start_page": 1213,
  "end_page": 1220,
  "volume": 14,
  "issue": 6,
  "editors": "",
  "publisher": "",
  "location": "",
  "pdf": "https://idl.cs.washington.edu/files/2008-Vispedia-InfoVis.pdf",
  "abstract": "Wikipedia is an example of the collaborative, semi-structured data sets emerging on the Web. These data sets have large, non-uniform schema that require costly data integration into structured tables before visualization can begin. We present Vispedia, a Web-based visualization system that reduces the cost of this data integration. Users can browse Wikipedia, select an interesting data table, then use a search interface to discover, integrate, and visualize additional columns of data drawn from multiple Wikipedia articles. This interaction is supported by a fast path search algorithm over DBpedia, a semantic graph extracted from Wikipedia’s hyperlink structure. Vispedia can also export the augmented data tables produced for use in traditional visualization systems. We believe that these techniques begin to address the “long tail” of visualization by allowing a wider audience to visualize a broader class of data. We evaluated this system in a ﬁrst-use formative lab study. Study participants were able to quickly create effective \r\nvisualizations for a diverse set of domains, performing data integration as needed.",
  "thumbnail": "images/thumbs/vispedia.gif",
  "figure": "images/figures/VispediaOverviewSmall.png",
  "caption": "Vispedia workﬂow: (a) While browsing Wikipedia, (b,c) a user ﬁnds a table and selects it using the Vispedia bookmarklet, (d) then picks a visualization type. On the Vispedia site, a list of table columns and the query recommender (e) help the user formulate an initial search query. Vispedia ﬁnds data matching the queries and creates a visualization (f). A user may then choose to browse back into Wikipedia, continue reﬁning the existing query, explore related data using different visualization types, or export the augmented data table.",
  "web_name": "vispedia",
  "visible": false,
  "mod_date": "2009-08-19",
  "note": "",
  "pub_date": "2008-10-01",
  "venue": "InfoVis",
  "authors": [
    {
      "first_name": "Bryan",
      "last_name": "Chan"
    },
    {
      "first_name": "Leslie",
      "last_name": "Wu"
    },
    {
      "first_name": "Justin",
      "last_name": "Talbot",
      "url": "http://www.justintalbot.com/"
    },
    {
      "first_name": "Mike",
      "last_name": "Cammarano"
    },
    {
      "first_name": "Pat",
      "last_name": "Hanrahan",
      "url": "http://graphics.stanford.edu/~hanrahan"
    }
  ],
  "materials": [
    {
      "name": "Website",
      "link": "http://vispedia.stanford.edu/"
    }
  ],
  "tags": []
}